src/cfe/Yaxunit/Enums/СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Yaxunit/Enums/КатегорииГрузов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КатегорииГрузов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обычный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Хрупкий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Опасный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Скоропортящийся</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Крупногабаритный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/Yaxunit/Documents/ЗаявкаОтЗаказчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаявкаОтЗаказчика</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Перевозка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Грузы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Груз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Грузы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/Yaxunit/Documents/ЗапросНаПеревозку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗапросНаПеревозку</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевозка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Перевозка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПлановаяДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПлановаяДатаРазгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Грузы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Груз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Грузы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/Yaxunit/Documents/РеализацияУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Заявка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявкаОтЗаказчика</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Перевозка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Перевозка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/Yaxunit/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Организации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БанковскиеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Yaxunit/Catalogs/НаправленияПеревозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>НаправленияПеревозок</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПунктОтправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПунктНазначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расстояние</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/Yaxunit/CommonModules/ЮТГенерацияДанных/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СлучайнаяЗаявка(Контрагент, Организация, Направление, Услуга, Груз) Экспорт
	
	Сумма = ЮТТестовыеДанные.СлучайноеЧисло(1000, 100000); 
	
	ДокЗаявка = Документы.ЗаявкаОтЗаказчика.СоздатьДокумент();
	ДокЗаявка.Дата = ЮТТестовыеДанные.СлучайнаяДатаДо(ТекущаяДатаСеанса() - 3*24*3600, 6, "месяца");
	ДокЗаявка.Статус = Перечисления.СтатусыЗаявок.Черновик;
	ДокЗаявка.Валюта = СлучайнаяВалюта();
	ДокЗаявка.Контрагент = Контрагент;
	ДокЗаявка.Организация = Организация;
	ДокЗаявка.Направление = Направление;
	ДокЗаявка.Ответственный = Пользователи.ТекущийПользователь();
	
	ДокЗаявка.СуммаДокумента = Сумма;
	
	НоваяСтрока = ДокЗаявка.Услуги.Добавить();
	НоваяСтрока.Услуга = Услуга;
	НоваяСтрока.Сумма = Сумма;
	НоваяСтрока.СуммаУпр = Сумма; 
	
	НоваяСтрока = ДокЗаявка.Грузы.Добавить();
	НоваяСтрока.Груз = Груз;
	
	ДокЗаявка.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат ДокЗаявка.Ссылка;
	
КонецФункции  

Функция СлучайныйЗапрос(Заявка = Неопределено) Экспорт 
	
	Если Заявка = Неопределено Тогда
		Заявка = ЮТГенерацияДанных.СлучайнаяЗаявка(
			ЮТГенерацияДанных.СлучайныйКонтрагент(Истина, Ложь, Ложь),
			ЮТГенерацияДанных.СлучайнаяОрганизация(Ложь),
			ЮТГенерацияДанных.СлучайноеНаправление(Ложь),
			ЮТГенерацияДанных.СлучайнаяУслуга(Ложь),
			ЮТГенерацияДанных.СлучайныйГруз(Ложь)
		);	
	КонецЕсли;
	
	ЗаявкаОбъект = Заявка.ПолучитьОбъект();
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Сумма = ЮТТестовыеДанные.СлучайноеЧисло(900, ЗаявкаОбъект.СуммаДокумента);
	
	Запрос = Документы.ЗапросНаПеревозку.СоздатьДокумент();
	Запрос.Дата = ЗаявкаОбъект.Дата + 1*24*3600;     
	Запрос.Заполнить(Заявка);
	Запрос.Контрагент = ЮТГенерацияДанных.СлучайныйКонтрагент(Ложь, Истина, Ложь);
	Запрос.СуммаДокумента = Сумма;	
	Запрос.ПлановаяДатаЗагрузки = Запрос.Дата + 1*24*3600;
	Запрос.ПлановаяДатаРазгрузки = Запрос.Дата + 2*24*3600;
	Запрос.Ответственный = Пользователи.ТекущийПользователь();
	
	НоваяСтрока = Запрос.Услуги.Добавить();
	НоваяСтрока.Услуга = ЮТГенерацияДанных.СлучайнаяУслуга(Ложь);
	НоваяСтрока.Сумма = Сумма;
	НоваяСтрока.СуммаУпр = Сумма;
	
	Запрос.Записать();
	
	Возврат Запрос.Ссылка;
	
КонецФункции

Функция СлучайнаяРеализацияУслуг(Заявка = Неопределено) Экспорт
	
	Если Заявка = Неопределено Тогда
		Заявка = ЮТГенерацияДанных.СлучайнаяЗаявка(
			ЮТГенерацияДанных.СлучайныйКонтрагент(Истина, Ложь, Ложь),
			ЮТГенерацияДанных.СлучайнаяОрганизация(Ложь),
			ЮТГенерацияДанных.СлучайноеНаправление(Ложь),
			ЮТГенерацияДанных.СлучайнаяУслуга(Ложь),
			ЮТГенерацияДанных.СлучайныйГруз(Ложь)
		);	
	КонецЕсли;		
	
	ЗаявкаОбъект = Заявка.ПолучитьОбъект();
	ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Если ЗаявкаОбъект.Перевозка.Пустая() Тогда 
		Запрос = СлучайныйЗапрос(ЗаявкаОбъект.Ссылка);
		Запрос.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	Реализация = Документы.РеализацияУслуг.СоздатьДокумент();
	Реализация.Дата = ЗаявкаОбъект.Дата + 2*24*3600; 
	Реализация.Ответственный = Пользователи.ТекущийПользователь();
	Реализация.Заполнить(Заявка);   
	Реализация.Записать();
	
	Возврат Реализация.Ссылка
	
КонецФункции

Функция СлучайнаяОрганизация(Создавать = Истина) Экспорт
	
	Если Создавать Тогда  
		
        НовыйЭлемент = Справочники.Организации.СоздатьЭлемент();
        НовыйЭлемент.Наименование = СгенерироватьНаименованиеОрганизации();
        НовыйЭлемент.ИНН = СлучайныйИНН();
        НовыйЭлемент.КПП = СлучайныйИНН();
        НовыйЭлемент.БанковскиеРеквизиты = ГенерацияБанковскихРеквизитов();
        НовыйЭлемент.Записать();
		
		Возврат НовыйЭлемент;    
		
    Иначе
		
		Выборка = Справочники.Организации.Выбрать();
        МассивЭлементов = Новый Массив;
        Пока Выборка.Следующий() Цикл
            МассивЭлементов.Добавить(Выборка.Ссылка);
        КонецЦикла;

        Если МассивЭлементов.Количество() > 0 Тогда
            Возврат МассивЭлементов[ЮТТестовыеДанные.СлучайноеЧисло(0, МассивЭлементов.Количество()-1)];
        Иначе
            Возврат СлучайнаяОрганизация(Истина);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецФункции

Функция СлучайноеНаправление(Создавать = Истина) Экспорт
	
	Если Создавать Тогда
        НовыйЭлемент = Справочники.НаправленияПеревозок.СоздатьЭлемент();
        НовыйЭлемент.ПунктОтправления = ГенерацияНаименованияПункта();
        НовыйЭлемент.ПунктНазначения = ГенерацияНаименованияПункта();
        Пока НовыйЭлемент.ПунктНазначения = НовыйЭлемент.ПунктОтправления Цикл
            НовыйЭлемент.ПунктНазначения = ГенерацияНаименованияПункта();
        КонецЦикла;
        НовыйЭлемент.Расстояние = ЮТТестовыеДанные.СлучайноеЧисло(100, 10000);
        НовыйЭлемент.Записать();
        Возврат НовыйЭлемент;
    Иначе
        Выборка = Справочники.НаправленияПеревозок.Выбрать();
        МассивЭлементов = Новый Массив;
        Пока Выборка.Следующий() Цикл
            МассивЭлементов.Добавить(Выборка.Ссылка);
        КонецЦикла;

        Если МассивЭлементов.Количество() > 0 Тогда
            Возврат МассивЭлементов[ЮТТестовыеДанные.СлучайноеЧисло(0, МассивЭлементов.Количество()-1)];
        Иначе
            Возврат СлучайноеНаправление(Истина);
        КонецЕсли;
	КонецЕсли; 
	
КонецФункции

// Возвращает случайную категорию груза из перечисления КатегорииГрузов
//
// Возвращаемое значение:
//   ПеречислениеСсылка.КатегорииГрузов - случайная категория
//
Функция СлучайнаяКатегория() Экспорт
    ЗначенияКатегорий = Новый Массив;
    ЗначенияКатегорий.Добавить(Перечисления.КатегорииГрузов.Обычный);
    ЗначенияКатегорий.Добавить(Перечисления.КатегорииГрузов.Хрупкий);
    ЗначенияКатегорий.Добавить(Перечисления.КатегорииГрузов.Опасный);
    ЗначенияКатегорий.Добавить(Перечисления.КатегорииГрузов.Скоропортящийся);
    ЗначенияКатегорий.Добавить(Перечисления.КатегорииГрузов.Крупногабаритный);
    
    Возврат ЗначенияКатегорий[ЮТТестовыеДанные.СлучайноеЧисло(0, ЗначенияКатегорий.Количество() - 1)];
КонецФункции

// Возвращает случайного контрагента из справочника или создает нового
//
// Параметры:
//  Заказчик - Булево - искать/создавать контрагента-заказчика (по умолчанию Истина)
//  Перевозчик - Булево - искать/создавать контрагента-перевозчика (по умолчанию Ложь)
//  СоздаватьНового - Булево - создавать нового контрагента, если Истина (по умолчанию Истина)
//
// Возвращаемое значение:
//  СправочникСсылка.Контрагенты - ссылка на контрагента
//
Функция СлучайныйКонтрагент(Знач Заказчик = Истина, Знач Перевозчик = Ложь, Знач СоздаватьНового = Истина) Экспорт
    
    Если Не СоздаватьНового Тогда
        // Поиск случайного существующего контрагента
        Возврат НайтиСлучайногоКонтрагента(Заказчик, Перевозчик);
    Иначе
        // Создание нового контрагента
        Возврат СоздатьСлучайногоКонтрагента(Заказчик, Перевозчик);
    КонецЕсли;
    
КонецФункции

Функция СлучайнаяВалюта() Экспорт
	
	Результат = Справочники.Валюты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Валюты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда  
		НоваяВалюта = Справочники.Валюты.СоздатьЭлемент();
		НоваяВалюта.Код = "643";
		НоваяВалюта.Наименование = "RUB";  
		НоваяВалюта.НаименованиеПолное = "Российский рубль";  
		НоваяВалюта.ПараметрыПрописи = "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2 знака"; 
		НоваяВалюта.Записать();
		Результат = НоваяВалюта.Ссылка;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает случайный груз из справочника или создает новый
//
// Параметры:
//   СоздаватьНовый - Булево - создавать новый груз, если Истина (по умолчанию Ложь)
//
// Возвращаемое значение:
//   СправочникСсылка.Грузы - ссылка на груз
//
Функция СлучайныйГруз(Знач СоздаватьНовый = Ложь) Экспорт
    
    Если Не СоздаватьНовый Тогда
        // Поиск случайного существующего груза
        Возврат НайтиСлучайныйГруз();
    Иначе
        // Создание нового груза
        Возврат СоздатьСлучайныйГруз();
    КонецЕсли;
    
КонецФункции

// Возвращает случайную услугу из справочника или создает новую
//
// Параметры:
//   СоздаватьНовую - Булево - создавать новую услугу, если Истина (по умолчанию Истина)
//
// Возвращаемое значение:
//   СправочникСсылка.Услуги - ссылка на услугу
//
Функция СлучайнаяУслуга(Знач СоздаватьНовую = Истина) Экспорт
    
    Если Не СоздаватьНовую Тогда
        // Поиск случайной существующей услуги
        Возврат НайтиСлучайнуюУслугу();
    Иначе
        // Создание новой услуги
        Возврат СоздатьСлучайнуюУслугу();
    КонецЕсли;
    
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция СлучайныйИНН()
	Возврат Строка(Формат(ЮТТестовыеДанные.СлучайноеЧисло(10000, 99999), "ЧГ=")) 
		+ Строка(Формат(ЮТТестовыеДанные.СлучайноеЧисло(10000, 99999), "ЧГ="));
КонецФункции

Функция ГенерацияБанковскихРеквизитов() Экспорт
    Возврат "Р/с " + СлучайныйИНН() + СлучайныйИНН()
        + " в банке " + СгенерироватьНаименованиеОрганизации();
КонецФункции

// Генерирует случайное наименование организации
//
// Параметры:
//   КраткоеНаименование - Булево - если Истина, генерирует краткое название (по умолчанию Ложь)
//   Специализация - Строка - специализация организации (необязательный)
//
// Возвращаемое значение:
//   Строка - сгенерированное наименование организации
//
Функция СгенерироватьНаименованиеОрганизации(Знач КраткоеНаименование = Ложь, Знач Специализация = Неопределено) Экспорт
    
    // Базы данных для генерации названий
    ОргФормы = Новый Массив;
    ОргФормы.Добавить("ООО");
    ОргФормы.Добавить("АО");
    ОргФормы.Добавить("ЗАО");
    ОргФормы.Добавить("ПАО");
    ОргФормы.Добавить("ИП");
    ОргФормы.Добавить("НКО");
    ОргФормы.Добавить("ГК");
    
    ОсновныеЧасти = Новый Массив;
    ОсновныеЧасти.Добавить("Техно");
    ОсновныеЧасти.Добавить("Инвест");
    ОсновныеЧасти.Добавить("Пром");
    ОсновныеЧасти.Добавить("Транс");
    ОсновныеЧасти.Добавить("Строй");
    ОсновныеЧасти.Добавить("Торг");
    ОсновныеЧасти.Добавить("Фин");
    ОсновныеЧасти.Добавить("Альфа");
    ОсновныеЧасти.Добавить("Металл");
    ОсновныеЧасти.Добавить("Нефте");
    
    Суффиксы = Новый Массив;
    Суффиксы.Добавить("Групп");
    Суффиксы.Добавить("Холдинг");
    Суффиксы.Добавить("Центр");
    Суффиксы.Добавить("Сервис");
    Суффиксы.Добавить("Трейд");
    Суффиксы.Добавить("Ресурс");
    Суффиксы.Добавить("Комплекс");
    Суффиксы.Добавить("Партнер");
    
    Города = Новый Массив;
    Города.Добавить("Москва");
    Города.Добавить("Санкт-Петербург");
    Города.Добавить("Новосибирск");
    Города.Добавить("Екатеринбург");
    Города.Добавить("Казань");
    Города.Добавить("Нижний Новгород");
    Города.Добавить("Краснодар");
    
    // Определяем специализацию, если не задана
    Если Специализация = Неопределено Тогда
        Специализации = Новый Массив;
        Специализации.Добавить("Строительство");
        Специализации.Добавить("Транспорт");
        Специализации.Добавить("Финансы");
        Специализации.Добавить("IT");
        Специализации.Добавить("Производство");
        Специализации.Добавить("Торговля");
        Специализации.Добавить("Услуги");
        Специализация = Специализации[ЮТТестовыеДанные.СлучайноеЧисло(0, Специализации.Количество() - 1)];
    КонецЕсли;
    
    // Генерация названия в зависимости от специализации
    Если Специализация = "Строительство" Тогда
        ОсновныеЧасти = Новый Массив;
        ОсновныеЧасти.Добавить("Строй");
        ОсновныеЧасти.Добавить("Монолит");
        ОсновныеЧасти.Добавить("Фундамент");
        ОсновныеЧасти.Добавить("Жил");
        ОсновныеЧасти.Добавить("Град");
        Суффиксы = Новый Массив;
        Суффиксы.Добавить("Проект");
        Суффиксы.Добавить("Строй");
        Суффиксы.Добавить("Дом");
    ИначеЕсли Специализация = "Транспорт" Тогда
        ОсновныеЧасти = Новый Массив;
        ОсновныеЧасти.Добавить("Транс");
        ОсновныеЧасти.Добавить("Авто");
        ОсновныеЧасти.Добавить("Фрахт");
        ОсновныеЧасти.Добавить("Логист");
        ОсновныеЧасти.Добавить("Экспресс");
        Суффиксы = Новый Массив;
        Суффиксы.Добавить("Карго");
        Суффиксы.Добавить("Логистик");
        Суффиксы.Добавить("Транзит");
    КонецЕсли;
    
    // Выбираем случайные элементы
    ОргФорма = ОргФормы[ЮТТестовыеДанные.СлучайноеЧисло(0, ОргФормы.Количество() - 1)];
    ОсновнаяЧасть = ОсновныеЧасти[ЮТТестовыеДанные.СлучайноеЧисло(0, ОсновныеЧасти.Количество() - 1)];
    Суффикс = Суффиксы[ЮТТестовыеДанные.СлучайноеЧисло(0, Суффиксы.Количество() - 1)];
    Город = Города[ЮТТестовыеДанные.СлучайноеЧисло(0, Города.Количество() - 1)];
    
    // Варианты форматов названий
    Если КраткоеНаименование Тогда
        Форматы = Новый Массив;
        Форматы.Добавить(ОргФорма + " " + ОсновнаяЧасть + Суффикс);
        Форматы.Добавить(ОргФорма + " " + ОсновнаяЧасть + Город);
        Форматы.Добавить(ОсновнаяЧасть + Суффикс);
    Иначе
        Форматы = Новый Массив;
        Форматы.Добавить(ОргФорма + " " + ОсновнаяЧасть + Суффикс);
        Форматы.Добавить(ОргФорма + " " + ОсновнаяЧасть + Суффикс + " " + Город);
        Форматы.Добавить(ОргФорма + " " + Суффикс + " " + ОсновнаяЧасть);
        Форматы.Добавить(ОргФорма + " " + ОсновнаяЧасть + " " + Город);
        Форматы.Добавить(ОсновнаяЧасть + " " + Суффикс + " " + Город);
    КонецЕсли;
    
    Наименование = Форматы[ЮТТестовыеДанные.СлучайноеЧисло(0, Форматы.Количество() - 1)];
    
    // Для ИП генерируем ФИО
    Если ОргФорма = "ИП" Тогда
        Наименование = СгенерироватьФИОДляИП();
    КонецЕсли;
    
    Возврат Наименование;  
	
КонецФункции

Функция СгенерироватьФИОДляИП()
    
    Фамилии = Новый Массив;
    Фамилии.Добавить("Иванов");
    Фамилии.Добавить("Петров");
    Фамилии.Добавить("Сидоров");
    Фамилии.Добавить("Кузнецов");
    Фамилии.Добавить("Смирнов");
    Фамилии.Добавить("Васильев");
    Фамилии.Добавить("Попов");
    
    Имена = Новый Массив;
    Имена.Добавить("Александр");
    Имена.Добавить("Дмитрий");
    Имена.Добавить("Сергей");
    Имена.Добавить("Андрей");
    Имена.Добавить("Михаил");
    Имена.Добавить("Евгений");
    Имена.Добавить("Алексей");
    
    Отчества = Новый Массив;
    Отчества.Добавить("Александрович");
    Отчества.Добавить("Дмитриевич");
    Отчества.Добавить("Сергеевич");
    Отчества.Добавить("Андреевич");
    Отчества.Добавить("Михайлович");
    Отчества.Добавить("Евгеньевич");
    Отчества.Добавить("Алексеевич");
    
    Возврат "ИП " + Фамилии[ЮТТестовыеДанные.СлучайноеЧисло(0, Фамилии.Количество() - 1)] + " " + 
           Имена[ЮТТестовыеДанные.СлучайноеЧисло(0, Имена.Количество() - 1)] + " " + 
           Отчества[ЮТТестовыеДанные.СлучайноеЧисло(0, Отчества.Количество() - 1)];
КонецФункции

Функция ГенерацияНаименованияПункта() 
	
	СписокНазваний = Новый Массив;
    СписокНазваний.Добавить("Москва");
    СписокНазваний.Добавить("Минск");
    СписокНазваний.Добавить("Санкт-Петербург");
    СписокНазваний.Добавить("Екатеринбург");
    СписокНазваний.Добавить("Новосибирск");
	СписокНазваний.Добавить("Владивосток");
	СписокНазваний.Добавить("Омск");
	СписокНазваний.Добавить("Киев");
	СписокНазваний.Добавить("Брянск");
	СписокНазваний.Добавить("Братск"); 
	СписокНазваний.Добавить("Томск");
	СписокНазваний.Добавить("Пинск");
	СписокНазваний.Добавить("Варшава");
	СписокНазваний.Добавить("Берлин");
	СписокНазваний.Добавить("Амстердам");
	СписокНазваний.Добавить("Орша");
	СписокНазваний.Добавить("Брест");
	СписокНазваний.Добавить("Могилев");
	СписокНазваний.Добавить("Борисов");
	СписокНазваний.Добавить("Бобруйск");
	СписокНазваний.Добавить("Вильнюс");
	
    Возврат СписокНазваний[ЮТТестовыеДанные.СлучайноеЧисло(0, СписокНазваний.Количество()-1)];

КонецФункции

// Вспомогательная функция для поиска случайной услуги
Функция НайтиСлучайнуюУслугу()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Услуги.Ссылка КАК Ссылка
    |ИЗ
    |    Справочник.Услуги КАК Услуги";
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    МассивУслуг = Новый Массив;
    Пока Выборка.Следующий() Цикл
        МассивУслуг.Добавить(Выборка.Ссылка);
    КонецЦикла;
    
    Если МассивУслуг.Количество() = 0 Тогда
        Возврат СлучайнаяУслуга(Истина);
    КонецЕсли;
    
    Возврат МассивУслуг[ЮТТестовыеДанные.СлучайноеЧисло(0, МассивУслуг.Количество() - 1)];
    
КонецФункции

// Вспомогательная функция для создания случайной услуги
Функция СоздатьСлучайнуюУслугу()
    
    НоваяУслуга = Справочники.Услуги.СоздатьЭлемент();
    
    // Генерация данных
    НоваяУслуга.Наименование = СгенерироватьНаименованиеУслуги();
    
    Попытка
        НоваяУслуга.Записать();
        Возврат НоваяУслуга.Ссылка;
    Исключение
        Сообщить("Ошибка при создании услуги: " + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции

// Генерирует случайное наименование услуги
//
// Возвращаемое значение:
//   Строка - сгенерированное наименование услуги
//
Функция СгенерироватьНаименованиеУслуги() Экспорт
    
    // Базы данных для генерации названий
    Префиксы = Новый Массив;
    Префиксы.Добавить("Услуга по");
    Префиксы.Добавить("Профессиональное");
    Префиксы.Добавить("Комплексное");
    Префиксы.Добавить("Экспресс");
    Префиксы.Добавить("Стандартное");
    
    ОсновныеЧасти = Новый Массив;
    ОсновныеЧасти.Добавить("обслуживанию");
    ОсновныеЧасти.Добавить("сопровождению");
    ОсновныеЧасти.Добавить("ремонту");
    ОсновныеЧасти.Добавить("монтажу");
    ОсновныеЧасти.Добавить("демонтажу");
    ОсновныеЧасти.Добавить("настройке");
    
    Объекты = Новый Массив;
    Объекты.Добавить("техники");
    Объекты.Добавить("оборудования");
    Объекты.Добавить("транспорта");
    Объекты.Добавить("систем");
    Объекты.Добавить("коммуникаций");
    Объекты.Добавить("ИТ-инфраструктуры");
    
    Суффиксы = Новый Массив;
    Суффиксы.Добавить("");
    Суффиксы.Добавить(" №" + Строка(ЮТТестовыеДанные.СлучайноеЧисло(1, 100)));
    Суффиксы.Добавить(" (премиум)");
    Суффиксы.Добавить(" (базовый пакет)");
    Суффиксы.Добавить(" для бизнеса");
    
    // Собираем название
    Префикс = Префиксы[ЮТТестовыеДанные.СлучайноеЧисло(0, Префиксы.Количество() - 1)];
    ОсновнаяЧасть = ОсновныеЧасти[ЮТТестовыеДанные.СлучайноеЧисло(0, ОсновныеЧасти.Количество() - 1)];
    Объект = Объекты[ЮТТестовыеДанные.СлучайноеЧисло(0, Объекты.Количество() - 1)];
    Суффикс = Суффиксы[ЮТТестовыеДанные.СлучайноеЧисло(0, Суффиксы.Количество() - 1)];
    
    Возврат СокрЛП(Префикс + " " + ОсновнаяЧасть + " " + Объект + Суффикс);
КонецФункции

// Вспомогательная функция для создания случайного груза
Функция СоздатьСлучайныйГруз()
    
    Категория = СлучайнаяКатегория();
    
    НовыйГруз = Справочники.Грузы.СоздатьЭлемент();
    
    // Генерация данных
    НовыйГруз.Наименование = СгенерироватьНаименованиеГруза(Категория);
    НовыйГруз.Категория = Категория;
    
    // Генерация веса и объема в зависимости от категории
    Если Категория = Перечисления.КатегорииГрузов.Крупногабаритный Тогда
        НовыйГруз.Вес = ЮТТестовыеДанные.СлучайноеЧисло(500, 5000); // кг
        НовыйГруз.Объем = ЮТТестовыеДанные.СлучайноеЧисло(5, 20); // м³
    ИначеЕсли Категория = Перечисления.КатегорииГрузов.Обычный Тогда
        НовыйГруз.Вес = ЮТТестовыеДанные.СлучайноеЧисло(10, 500); // кг
        НовыйГруз.Объем = ЮТТестовыеДанные.СлучайноеЧисло(0.1, 5); // м³
    Иначе
        НовыйГруз.Вес =ЮТТестовыеДанные. СлучайноеЧисло(1, 200); // кг
        НовыйГруз.Объем = ЮТТестовыеДанные.СлучайноеЧисло(0.01, 2); // м³
    КонецЕсли;
    
    // Генерация требований к ТС
    Если Категория = Перечисления.КатегорииГрузов.Опасный Тогда
        НовыйГруз.ТребованияКТС = "Требуется спецтранспорт для опасных грузов";
    ИначеЕсли Категория = Перечисления.КатегорииГрузов.Скоропортящийся Тогда
        НовыйГруз.ТребованияКТС = "Требуется рефрижератор";
    ИначеЕсли Категория = Перечисления.КатегорииГрузов.Хрупкий Тогда
        НовыйГруз.ТребованияКТС = "Требуется бережная перевозка";
    ИначеЕсли Категория = Перечисления.КатегорииГрузов.Крупногабаритный Тогда
        НовыйГруз.ТребованияКТС = "Требуется длинномерный транспорт";
    Иначе
        НовыйГруз.ТребованияКТС = "Стандартные требования";
    КонецЕсли;
    
    Попытка
        НовыйГруз.Записать();
        Возврат НовыйГруз.Ссылка;
    Исключение
        Сообщить("Ошибка при создании груза: " + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;
    
КонецФункции

// Вспомогательная функция для поиска случайного груза
Функция НайтиСлучайныйГруз()
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Грузы.Ссылка КАК Ссылка
    |ИЗ
    |    Справочник.Грузы КАК Грузы";
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    МассивГрузов = Новый Массив;
    Пока Выборка.Следующий() Цикл
        МассивГрузов.Добавить(Выборка.Ссылка);
    КонецЦикла;
    
    Если МассивГрузов.Количество() = 0 Тогда
        Возврат СоздатьСлучайныйГруз();
    КонецЕсли;
    
    Возврат МассивГрузов[ЮТТестовыеДанные.СлучайноеЧисло(0, МассивГрузов.Количество() - 1)];
    
КонецФункции

// Генерирует случайное наименование груза в зависимости от категории
//
// Параметры:
//   Категория - ПеречислениеСсылка.КатегорииГрузов - категория груза
//
// Возвращаемое значение:
//   Строка - сгенерированное наименование груза
//
Функция СгенерироватьНаименованиеГруза(Знач Категория = Неопределено)
    
    Если Категория = Неопределено Тогда
        Категория = СлучайнаяКатегория();
    КонецЕсли;
    
    // Базы данных для генерации названий
    Префиксы = Новый Массив;
    Префиксы.Добавить("Груз");
    Префиксы.Добавить("Партия");
    Префиксы.Добавить("Товар");
    Префиксы.Добавить("Изделие");
    Префиксы.Добавить("Материал");
    
    ОсновныеЧасти = Новый Массив;
    
    Если Категория = Перечисления.КатегорииГрузов.Обычный Тогда
        ОсновныеЧасти.Добавить("бытовой техники");
        ОсновныеЧасти.Добавить("металлопроката");
        ОсновныеЧасти.Добавить("текстиля");
        ОсновныеЧасти.Добавить("канцтоваров");
        ОсновныеЧасти.Добавить("хозтоваров");
    ИначеЕсли Категория = Перечисления.КатегорииГрузов.Хрупкий Тогда
        ОсновныеЧасти.Добавить("стеклянных изделий");
        ОсновныеЧасти.Добавить("керамики");
        ОсновныеЧасти.Добавить("зеркал");
        ОсновныеЧасти.Добавить("ламп");
        ОсновныеЧасти.Добавить("электроники");
    ИначеЕсли Категория = Перечисления.КатегорииГрузов.Опасный Тогда
        ОсновныеЧасти.Добавить("химических веществ");
        ОсновныеЧасти.Добавить("легковоспламеняющихся материалов");
        ОсновныеЧасти.Добавить("газовых баллонов");
        ОсновныеЧасти.Добавить("аккумуляторов");
        ОсновныеЧасти.Добавить("лакокрасочных материалов");
    ИначеЕсли Категория = Перечисления.КатегорииГрузов.Скоропортящийся Тогда
        ОсновныеЧасти.Добавить("продуктов питания");
        ОсновныеЧасти.Добавить("фармацевтики");
        ОсновныеЧасти.Добавить("цветов");
        ОсновныеЧасти.Добавить("молочной продукции");
        ОсновныеЧасти.Добавить("охлажденного мяса");
    ИначеЕсли Категория = Перечисления.КатегорииГрузов.Крупногабаритный Тогда
        ОсновныеЧасти.Добавить("строительных материалов");
        ОсновныеЧасти.Добавить("промышленного оборудования");
        ОсновныеЧасти.Добавить("мебели");
        ОсновныеЧасти.Добавить("труб");
        ОсновныеЧасти.Добавить("металлоконструкций");
    КонецЕсли;
    
    Суффиксы = Новый Массив;
    Суффиксы.Добавить("");
    Суффиксы.Добавить(" №" + Строка(ЮТТестовыеДанные.СлучайноеЧисло(1, 1000)));
    Суффиксы.Добавить(" (партия " + Строка(ЮТТестовыеДанные.СлучайноеЧисло(1, 50)) + ")");
    Суффиксы.Добавить(" для транспортировки");
    
    // Собираем название
    Префикс = Префиксы[ЮТТестовыеДанные.СлучайноеЧисло(0, Префиксы.Количество() - 1)];
    ОсновнаяЧасть = ОсновныеЧасти[ЮТТестовыеДанные.СлучайноеЧисло(0, ОсновныеЧасти.Количество() - 1)];
    Суффикс = Суффиксы[ЮТТестовыеДанные.СлучайноеЧисло(0, Суффиксы.Количество() - 1)];
    
    Возврат Префикс + " " + ОсновнаяЧасть + Суффикс;     
	
КонецФункции

// Вспомогательная функция для поиска случайного контрагента
Функция НайтиСлучайногоКонтрагента(Заказчик, Перевозчик)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Контрагенты.Ссылка КАК Ссылка
    |ИЗ
    |    Справочник.Контрагенты КАК Контрагенты
    |ГДЕ
    |    Контрагенты.Заказчик = &Заказчик
    |    И Контрагенты.Перевозчик = &Перевозчик";
    
    Запрос.УстановитьПараметр("Заказчик", Заказчик);
    Запрос.УстановитьПараметр("Перевозчик", Перевозчик);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    МассивКонтрагентов = Новый Массив;
    Пока Выборка.Следующий() Цикл
        МассивКонтрагентов.Добавить(Выборка.Ссылка);
    КонецЦикла;
    
    Если МассивКонтрагентов.Количество() = 0 Тогда
        Возврат СоздатьСлучайногоКонтрагента(Заказчик, Перевозчик);
    КонецЕсли;
    
    Возврат МассивКонтрагентов[ЮТТестовыеДанные.СлучайноеЧисло(0, МассивКонтрагентов.Количество() - 1)];
    
КонецФункции

// Вспомогательная функция для создания случайного контрагента
Функция СоздатьСлучайногоКонтрагента(Заказчик, Перевозчик)
    
    НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
    
    // Генерация случайных данных
    НовыйКонтрагент.Наименование = СгенерироватьНаименованиеКонтрагента(Заказчик, Перевозчик);
    НовыйКонтрагент.Заказчик = Заказчик;
    НовыйКонтрагент.Перевозчик = Перевозчик; 
	
	
	НовыйКонтрагент.ИНН = СлучайныйИНН();
    НовыйКонтрагент.КПП = СлучайныйИНН();
	
    НовыйКонтрагент.Контакты = "Тел: +7" + Строка(ЮТТестовыеДанные.СлучайноеЧисло(100000000, 399999999));
    
    НовыйКонтрагент.Записать();
    
    Возврат НовыйКонтрагент.Ссылка;
    
КонецФункции

// Генерирует случайное наименование для контрагента
//
// Параметры:
//   Заказчик - Булево - является ли контрагент заказчиком
//   Перевозчик - Булево - является ли контрагент перевозчиком
//
// Возвращаемое значение:
//   Строка - сгенерированное наименование контрагента
//
Функция СгенерироватьНаименованиеКонтрагента(Знач Заказчик = Истина, Знач Перевозчик = Ложь) Экспорт
    
    // Базы данных для генерации названий
    Префиксы = Новый Массив;
    Префиксы.Добавить("ООО");
    Префиксы.Добавить("АО");
    Префиксы.Добавить("ЗАО");
    Префиксы.Добавить("ИП");
    Префиксы.Добавить("ГК");
    Префиксы.Добавить("Холдинг");
    
    ОсновныеЧастиЗаказчиков = Новый Массив;
    ОсновныеЧастиЗаказчиков.Добавить("Промышленный");
    ОсновныеЧастиЗаказчиков.Добавить("Торговый");
    ОсновныеЧастиЗаказчиков.Добавить("Строительный");
    ОсновныеЧастиЗаказчиков.Добавить("Технологический");
    ОсновныеЧастиЗаказчиков.Добавить("Производственный");
    ОсновныеЧастиЗаказчиков.Добавить("Инвестиционный");
    
    ОсновныеЧастиПеревозчиков = Новый Массив;
    ОсновныеЧастиПеревозчиков.Добавить("Транспортный");
    ОсновныеЧастиПеревозчиков.Добавить("Логистический");
    ОсновныеЧастиПеревозчиков.Добавить("Грузовой");
    ОсновныеЧастиПеревозчиков.Добавить("Экспедиционный");
    ОсновныеЧастиПеревозчиков.Добавить("Автоперевозок");
    ОсновныеЧастиПеревозчиков.Добавить("Фрахтовый");
    
    Суффиксы = Новый Массив;
    Суффиксы.Добавить("Центр");
    Суффиксы.Добавить("Комплекс");
    Суффиксы.Добавить("Альянс");
    Суффиксы.Добавить("Сервис");
    Суффиксы.Добавить("Групп");
    Суффиксы.Добавить("Трейд");
    Суффиксы.Добавить("Логистик");
    
    Города = Новый Массив;
    Города.Добавить("Москва");
    Города.Добавить("Санкт-Петербург");
    Города.Добавить("Новосибирск");
    Города.Добавить("Екатеринбург");
    Города.Добавить("Казань");
    Города.Добавить("Нижний Новгород");
    
    // Выбираем случайные элементы
    Префикс = Префиксы[ЮТТестовыеДанные.СлучайноеЧисло(0, Префиксы.Количество() - 1)];
    
    Если Заказчик И Перевозчик Тогда
        ОсновнаяЧасть1 = ОсновныеЧастиЗаказчиков[ЮТТестовыеДанные.СлучайноеЧисло(0, ОсновныеЧастиЗаказчиков.Количество() - 1)];
        ОсновнаяЧасть2 = ОсновныеЧастиПеревозчиков[ЮТТестовыеДанные.СлучайноеЧисло(0, ОсновныеЧастиПеревозчиков.Количество() - 1)];
        ОсновнаяЧасть = ОсновнаяЧасть1 + "-" + ОсновнаяЧасть2;
    ИначеЕсли Заказчик Тогда
        ОсновнаяЧасть = ОсновныеЧастиЗаказчиков[ЮТТестовыеДанные.СлучайноеЧисло(0, ОсновныеЧастиЗаказчиков.Количество() - 1)];
    ИначеЕсли Перевозчик Тогда
        ОсновнаяЧасть = ОсновныеЧастиПеревозчиков[ЮТТестовыеДанные.СлучайноеЧисло(0, ОсновныеЧастиПеревозчиков.Количество() - 1)];
    Иначе
        ОсновнаяЧасть = "Коммерческий";
    КонецЕсли;
    
    Суффикс = Суффиксы[ЮТТестовыеДанные.СлучайноеЧисло(0, Суффиксы.Количество() - 1)];
    Город = Города[ЮТТестовыеДанные.СлучайноеЧисло(0, Города.Количество() - 1)];
    
    // Варианты форматов названий
    Форматы = Новый Массив;
    Форматы.Добавить(Префикс + " " + ОсновнаяЧасть + " " + Суффикс);
    Форматы.Добавить(Префикс + " " + ОсновнаяЧасть + " " + Суффикс + " " + Город);
    Форматы.Добавить(Префикс + " " + Суффикс + " " + ОсновнаяЧасть);
    Форматы.Добавить(ОсновнаяЧасть + " " + Суффикс);
    
    Возврат Форматы[ЮТТестовыеДанные.СлучайноеЧисло(0, Форматы.Количество() - 1)];
    
КонецФункции

#КонецОбласти
